## Plan Result (prod-prod)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.hmcts_net.azurerm_dns_ns_record.this[&#34;internal&#34;]
  * module.hmcts_net.azurerm_dns_zone.zone
  * module.hmcts_net.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hmcts_net.azurerm_dns_ns_record.this["internal"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "internal"
      + records             = [
          + "ns1-02.azure-dns.com",
          + "ns2-02.azure-dns.net",
          + "ns3-02.azure-dns.org",
          + "ns4-02.azure-dns.info",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 900
      + zone_name           = "hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.hmcts_net.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1137,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->